<div style="
    color: red; 
    border: 2px solid black; 
    border-radius: 15px; 
    padding: 8px; 
    font-size: 24px; 
    font-weight: bold; 
    text-align: center; 
    margin: 20px 0;">
    <div style="
        border: 2px solid red; 
        border-radius: 10px; 
        padding: 10px;">
        <img src="https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/file-uploads/themes/2155698250/settings_images/dd1ab6f-208-d4e5-d187-483a245d87_logo_header_Datailab.png" alt="Datailab Logo" style="max-width: 100%; height: auto;">
        <h2 style="color: black; margin-top: 10px;">SQL , NULL et CASE </h2>
    </div>
</div>

# Null, CASE

Nous couvrirons les expressions **NULL** et **CASE** dans cette section. Une valeur **NULL** n'est pas une valeur, tout comme un **None** ou **NaN** en Python indique une valeur vide. L'expression **CASE** nous permet d'associer des conditions aux valeurs résultantes, un peu comme un **if/ elif else** en Python.

# SET UP

In [ ]:
%pip install -q ipywidgets pandas matplotlib sqlite3 ipython-sql

In [ ]:
import sqlite3
import pandas as pd



conn = sqlite3.connect('data/company_operations.db')

# Valeurs NULL

Jeter un coup d'oeil sur les rapports suivants : 'LJVE08D', 'EP4AKZR', '1FC27OH', 'F4DEAK3' se trouvant dans la table WEATHER_MONITOR

In [ ]:
sql="""
SELECT * FROM WEATHER_MONITOR
WHERE REPORT_CODE IN ('LJVE08D', 'EP4AKZR', '1FC27OH', 'F4DEAK3')
"""
pd.read_sql(sql,conn)

* Donner tous les enregistrements tels que RAIN contient une valeur Null ( None )

| | ID | RAPPORT_CODE | RAPPORT_DATE | LOCATION_ID | TEMPERATURE | OVERCAST | RAIN | SNOW | LIGHTNING | HAIL | TORNADO |
|----:|-----:|:--------------|:--------------|--------------:|--------------:|-----------:|:-------|-------:|------------:|-------:|----------:|
| 0 | 9 | G0UINBG | 2021-05-04 | 14 | 62.2 | 1 |None | 0 | 0 | 0 | 0 |
| 1 | 17 | 89U7PF3 | 2021-05-02 | 2 | 67,8 | 0 |None | 0 | 0 | 0 | 0 |
| 2 | 45 | EP4AKZR | 2021-03-11 | 32 | 64,5 | 0 |None | 0 | 0 | 0 | 0 |
| 3 | 80 | EPQO1H8 | 2021-05-09 | 31 | 54.1 | 0 |None | 0 | 0 | 0 | 0 |
| 159 | 2967 | 1FC27OH | 2020-12-01 | 16 | 89,7 | 0 |None | 0 | 0 | 0 | 0 |
| 160 | 2973 | OXDUXW5 | 2020-11-02 | 44 | 100,2 | 1 |None | 0 | 0 | 0 | 0 |
| 161 | 2975 | EA8O3S0 | 2020-12-01 | 6 | 92.2 | 1 |None | 0 | 0 | 0 | 0 |

In [ ]:
sql ="""
SELECT * FROM WEATHER_MONITOR
-- filtrer les null : IS NULL
WHERE RAIN IS NULL
"""
pd.read_sql(sql,conn).tail(3)

* Filtrer les valeurs telsque RAIN est non NULL

In [ ]:
sql ="""
SELECT * FROM WEATHER_MONITOR
-- filtrer les NON null : IS NOT NULL
WHERE RAIN IS NOT NULL
"""
pd.read_sql(sql,conn)

* Filtrer RAIN avec al conditions RAIN > 0 exclu automatiquement les valeurs NULL

In [ ]:
sql ="""
SELECT * FROM WEATHER_MONITOR
WHERE RAIN > 0
"""
pd.read_sql(sql,conn)

* Filtrer les valurs de RAIN > 0 **OU** les valeurs NULL

In [ ]:
sql ="""
SELECT * FROM WEATHER_MONITOR
WHERE RAIN > 0 OR RAIN IS NULL
"""
pd.read_sql(sql,conn).head(10)

# COALESCE()

Convertie la valeur Null en une une valeur définie par l'utilisateur
```sql
-- convertir toutes les valeurs qui sont Null dans la colonne RAIN par 0 , et laisser les autres valeurs tels quelles sont
COALESCE(RAIN,0)
```

In [ ]:
sql ="""
SELECT RAIN,COALESCE(RAIN,0) AS COALESCE_  FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn).head(20)

In [ ]:
sql = """
SELECT REPORT_CODE,
       RAIN,
       COALESCE(RAIN, -1) COALESCE_RAIN
FROM WEATHER_MONITOR
WHERE REPORT_CODE IN ('G0UINBG', 'PJVNOSP')
"""
pd.read_sql(sql,conn)

# CASE

In [ ]:
sql ="""
SELECT REPORT_CODE,
      TEMPERATURE
FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn)

* AFFICHER ceci
  - SI la température >=78 --> HOT
  - SI la température >=60 et < 78 --> MILD
  - SI la température < 60 --> COLD

-----------


|      | REPORT_CODE   |   TEMPERATURE | TEMPERATURE_LABEL   |
|-----:|:--------------|--------------:|:--------------------|
|    0 | UVYMMWW       |          66   | MILD                |
|    1 | 7VVYE2L       |          61.3 | MILD                |
|    2 | PJVNOSP       |          61.6 | MILD                |
|    3 | 3B19P7S       |          66.3 | MILD                |
|    4 | EHVUPGY       |          58.5 | COLD                |
|    5 | ZBAHLGO       |          65   | MILD                |

In [ ]:
sql = """
SELECT REPORT_CODE,
      TEMPERATURE,
      CASE
        WHEN TEMPERATURE >=78 THEN 'HOT'
        WHEN TEMPERATURE >=60 THEN 'MILD'
        ELSE 'COLD'
      END AS TEMPERATURE_LABEL
FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn)

In [ ]:
%load_ext sql

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%sql sqlite:///data/company_operations.db

In [ ]:
%%sql
SELECT REPORT_CODE,
      TEMPERATURE,
      CASE
        WHEN TEMPERATURE >=78 THEN 'HOT'
        WHEN TEMPERATURE >=60 THEN 'MILD'
        ELSE 'COLD'
      END AS TEMPERATURE_LABEL
FROM WEATHER_MONITOR
LIMIT 5

```sql
SELECT REPORT_CODE,
      TEMPERATURE,
      CASE
        WHEN TEMPERATURE >=78 THEN 'HOT'
        WHEN TEMPERATURE >=60 THEN 'MILD'
        ELSE 'COLD'
      END AS TEMPERATURE_LABEL
FROM WEATHER_MONITOR
```

Dans le code SQL précédent le ELSE affecte 'COLD' aux valeurs de temperatures qui sont < 60 et aussi les valeur NULL

In [ ]:
sql = """
SELECT REPORT_CODE,
      TEMPERATURE,
      CASE
        WHEN TEMPERATURE >=78 THEN 'HOT'
        WHEN TEMPERATURE >=60 THEN 'MILD'
        WHEN TEMPERATURE < 60 THEN 'COLD'
        -- ELSE traite seulement les valeurs Null
        ELSE 'N/A'
      END AS TEMPERATURE_LABEL
FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn)

In [ ]:
df = pd.read_sql(sql,conn)

In [ ]:
df[df['TEMPERATURE_LABEL'] == 'N/A']

# REMARQUES COALESCE() et CASE
* Remplacer `COALESCE(RAIN,0)` par `CASE`
```sql
SELECT RAIN,COALESCE(RAIN,0) AS COALESCE_  FROM WEATHER_MONITOR
```

In [ ]:
sql ="""
SELECT RAIN,COALESCE(RAIN,0) AS COALESCE_  FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn).head(20)

In [ ]:
sql = """
SELECT RAIN,
      CASE
          WHEN RAIN IS NULL THEN 1
          ELSE RAIN
      END AS COALESCE_
FROM WEATHER_MONITOR
"""
pd.read_sql(sql,conn).head(20)

# NULL CASE truc et astuces

* Calculer Total `Rain` groupé par `YEAR` et `MONTH` seulement pour l'année  2021 ( de la table `WEATHER_MONITOR`)

|    |   YEAR |   MONTH |   TOTAL_RAIN |
|---:|-------:|--------:|-------------:|
|  0 |   2021 |       1 |       316.27 |
|  1 |   2021 |       2 |       138.07 |
|  2 |   2021 |       3 |       129.03 |
|  3 |   2021 |       4 |       153.79 |
|  4 |   2021 |       5 |       158.24 |

In [ ]:
%%sql
SELECT * FROM WEATHER_MONITOR
LIMIT 5

In [ ]:
%%sql
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM(RAIN) AS TOTAL_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH

In [ ]:
sql = """
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM(RAIN) AS TOTAL_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH
"""
pd.read_sql(sql,conn)

SQLITE

```sql
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM(RAIN) AS TOTAL_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH
```



ORACLE SQL

```sql
SELECT
    TO_NUMBER(TO_CHAR(REPORT_DATE, 'YYYY')) AS YEAR,
    TO_NUMBER(TO_CHAR(REPORT_DATE, 'MM')) AS MONTH,
    SUM(RAIN) AS TOTAL_RAIN
FROM
    WEATHER_MONITOR
WHERE
    EXTRACT(YEAR FROM REPORT_DATE) = 2021
GROUP BY
    TO_NUMBER(TO_CHAR(REPORT_DATE, 'YYYY')),
    TO_NUMBER(TO_CHAR(REPORT_DATE, 'MM'));
```

SQL SERVER (T-SQL)

```sql
SELECT
    YEAR(REPORT_DATE) AS YEAR,
    MONTH(REPORT_DATE) AS MONTH,
    SUM(RAIN) AS TOTAL_RAIN
FROM
    WEATHER_MONITOR
WHERE
    YEAR(REPORT_DATE) = 2021
GROUP BY
    YEAR(REPORT_DATE), MONTH(REPORT_DATE);
```

* On veut diviser TOTAL_RAIN  en deux colonnes, une  quand  TORNADO = 1  et une autre  pour  TORNADO = 0. Quel est le problème ici ?

| | ANNÉE | MOIS | TOTAL_TORNADO_RAIN | TOTAL_NON_TORNADO_RAIN |
|---:|-------:|--------:|---------------------:|-------------------------:|
|  0 |   2021 |       2 |                15.22 |                    15.22 |
|  1 |   2021 |       3 |                24.92 |                    24.92 |
|  2 |   2021 |       4 |                 9.87 |                     9.87 |
|  3 |   2021 |       5 |                19.88 |                    19.88 |

In [ ]:
%%sql
--by Kenza
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       tornado,
       round(SUM(RAIN),2) AS TOTAL_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH, tornado

In [ ]:
sql = """
---le filtre s'applique aux deux colonnes
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM(RAIN) AS TOTALTORNADO_RAIN,
       SUM(RAIN) AS TOTAL_NON_TORNADO_RAIN
FROM WEATHER_MONITOR
WHERE TORNADO =0 AND YEAR = 2021
GROUP BY YEAR, MONTH
"""
pd.read_sql(sql,conn)

In [ ]:
sql = """
--Solution AVEC CASE
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM( CASE WHEN TORNADO = 1 THEN RAIN ELSE 0 END ) AS TOTALTORNADO_RAIN,
       SUM( CASE WHEN TORNADO = 0 THEN RAIN ELSE 0 END ) AS TOTAL_NON_TORNADO_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH
"""
pd.read_sql(sql,conn)

Cependant, un 0 pour la condition fausse peut être problématique pour d'autres opérations d'agrégation comme MIN, MAX et AVG et COUNT car cela affectera ces calculs contrairement à SUM. Vous pouvez plutôt utiliser NULL car il sera ignoré par tous les opérateurs d'agrégation, y compris SUM.

In [ ]:
sql = """
--Solution AVEC CASE et NULL
SELECT CAST(strftime('%Y', REPORT_DATE) AS INTEGER) AS YEAR,
       CAST(strftime('%m', REPORT_DATE) AS INTEGER ) AS MONTH,
       SUM( CASE WHEN TORNADO = 1 THEN RAIN ELSE NULL END ) AS TOTALTORNADO_RAIN,
       SUM( CASE WHEN TORNADO = 0 THEN RAIN ELSE NULL END ) AS TOTAL_NON_TORNADO_RAIN
FROM WEATHER_MONITOR
WHERE YEAR = 2021
GROUP BY YEAR, MONTH
"""
pd.read_sql(sql,conn)

```sql
--T sql
SELECT
    YEAR(REPORT_DATE) AS YEAR,
    MONTH(REPORT_DATE) AS MONTH,
    SUM(CASE WHEN TORNADO = 1 THEN RAIN ELSE 0 END) AS TOTALTORNADO_RAIN,
    SUM(CASE WHEN TORNADO = 0 THEN RAIN ELSE 0 END) AS TOTAL_NON_TORNADO_RAIN
FROM
    WEATHER_MONITOR
WHERE
    YEAR(REPORT_DATE) = 2021
GROUP BY
    YEAR(REPORT_DATE), MONTH(REPORT_DATE);

```

# EXERCICE
Pour chaque LOCATION_ID, calculez la pluie totale de l'année précédente **PY_RAIN** (2020) et la pluie totale de l'année en cours **CY_RAIN** (2021).


* Ceci est le résultat pour les 5 premières lignes

| | LOCATION_ID | CY_RAIN | PY_RAIN |
|---:|--------------:|----------:|----------:|
|  0 |             0 |     18.99 |     24.72 |
|  1 |             1 |     22.51 |     45.02 |
|  2 |             2 |     30.72 |     16.04 |
|  3 |             3 |     15.57 |     22.8  |
|  4 |             4 |     30.17 |     30.15 |
|  5 |             5 |     40.71 |      7.92 |

In [ ]:
# by SYLVIE
sql = """
SELECT
  LOCATION_ID,
  ROUND(SUM(CASE WHEN strftime('%Y', REPORT_DATE) = '2021' THEN RAIN ELSE NULL END), 2) AS CY_RAIN,
  ROUND(SUM(CASE WHEN strftime('%Y', REPORT_DATE) = '2020' THEN RAIN ELSE NULL END), 2) AS PY_RAIN
FROM WEATHER_MONITOR
GROUP BY LOCATION_ID
ORDER BY LOCATION_ID
LIMIT 6"""
pd.read_sql(sql,conn)

In [ ]:
# by KENZA
sql = """
SELECT LOCATION_ID,
       SUM( CASE WHEN CAST(strftime('%Y', REPORT_DATE) AS INTEGER) = 2021 THEN RAIN ELSE null END ) AS PY_RAIN,
       SUM( CASE WHEN CAST(strftime('%Y', REPORT_DATE) AS INTEGER) = 2020 THEN RAIN ELSE null END ) AS CY_RAIN
FROM WEATHER_MONITOR
GROUP BY LOCATION_ID
LIMIT 6
"""
pd.read_sql(sql,conn)